[
    { "id": 1, 
        "description": "The Graduation Ceremony 2023, was a memorable celebration of achievement and growth. We brought together graduates, faculty, and peers to honor the hard work and dedication of the students. The event featured inspiring speeches, award presentations, and a showcase of notable projects from our club members, highlighting their contributions to the IT community.", 
        "title": "Graduation Ceremony 2023", 
        "url": "https://www.youtube.com/embed/vE8e-42ZpPw?si=bdJgYVtCOkCewpuU" },
    { "id": 2, 
        "description":"The Graduation Ceremony 2022 marked a significant milestone as the first graduation ceremony organized in our university. We aimed to create a memorable experience for the graduates, their families, and faculty members.", 
        "title": "Graduation Ceremony 2022", 
        "url": "https://www.youtube.com/embed/nqhnZkGTaeA?si=yUmQXI0Zr1lfkXE6" },
    { "id": 3, 
        "description": "Design Night was an exciting and dynamic event aimed at fostering creativity and collaboration. Participants, worked in teams to tackle a design challenge proposed by STB Bank.", 
        "title": "Design Night Hackathon", 
        "url": "https://www.youtube.com/embed/QD2CBCyDZuU?si=eX8eLviqWYB-l_sp" },
    { "id": 4, 
        "description": "The Spring Boot Microservices Online Workshop, organized by our club, was a hands-on event designed to introduce participants to the fundamentals of building scalable and efficient microservices using Spring Boot.", 
        "title": "Spring Boot Microservices Online Workshop Part 1", 
        "url": "https://www.youtube.com/embed/jf-R66ekRFo?si=tEkKsTvWiBViLsWJ" },
    { "id": 5, 
        "description": "Part 2 The Spring Boot Microservices Online Workshop, going more indepth into the microservice architecture and finishing the project.", 
        "title": "Spring Boot Microservices Online Workshop Part 2", 
        "url": "https://www.youtube.com/embed/MgxdNZNLWcc?si=ssB6qfDaCDZ7XkEN" },
    { "id": 6, 
        "description": "The Angular Online Workshop, organized by our club, was an interactive event focused on teaching participants how to build dynamic, single-page applications using the Angular framework.", 
        "title": "Angular Online Workshop", 
        "url": "https://www.youtube.com/embed/2jmDBvvZGj8?si=ekMtrtvd4_505ujO" }
]
